# **Introduction to Pandas**
---



* Open-source Python library designed for data manipulation and analysis
* Provides data structures like Series and DataFrames to easily clean, transform and analyze large datasets
* Offers functions for data transformation, aggregation and visualization

## **Uses of Pandas**
* Reading and writing data from various file formats like CSV, Excel and SQL databases.
* Cleaning and preparing data by handling missing values and filtering entries.
* Merging and joining multiple datasets seamlessly.
* Conducting statistical analysis and generating descriptive statistics.
* Visualizing data with integrated plotting capabilities.

## **Pandas vs Excel**

* Can handle large sized data efficiently, excel is prone to crashes
* Can automate using Python scripts
* Data cleaning easier using built-in functions
* Integration with Machine Learning libraries

## **Installing and Importing Pandas**

In [2]:
pip install pandas

Collecting pandas
  Downloading pandas-2.3.3-cp313-cp313-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\cpatlprabhakarm\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\cpatlprabhakarm\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: tzdata>=2022.7 in c:\users\cpatlprabhakarm\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\cpatlprabhakarm\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp313-cp313-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
    --------------------------------------- 0.3/11.0 MB ? eta -:--:--
   - -------------------------------------- 0.5/11.0 MB 1.5 MB/s eta 0:00:07
   --- ------------------------------------ 1.0/11.0 MB 1.6 MB/s eta 0:00:07
   ---- ----------------------------------- 1.3/11.0 MB 1.6 MB/s eta 0:00:06
   ----- ---------------------------------- 1.6/11.0 MB 1.6 MB/s eta 0:00:06
   ------ --------------------------------- 1.8/11.0 MB 1.6 MB/s eta 0:00:06
   ------- -------------------------------- 2.1/11.0 MB 1.5 MB/s eta 0:00:06
   -------- ------------------------------- 2.4/11.0 MB 1.5 MB/s eta 0:00:06
   --------- ------------------------------ 2.6/11.0 MB 1.4 MB/s eta 0:00:06
   ---------- ----------------------------- 2.9/11.0 MB 1.4 MB/s eta 0:00:06
   ----------- ---------------------------- 3.1/11.0 MB 1.3 MB/s eta 0:00:06
   ----------- ---------------------------- 3.1/11.0 MB 1.3 MB/s eta 0:00:06
   ------------ --------------------------- 3.4/11.0 MB 1.3 MB/s eta 0:00:06
   ------------- -------------------------- 3.7/11.0 MB 1.3 MB/s eta 0:00:06
   -------------- ------------------------- 3.9/11.0 MB 1.3 MB/s eta 0:00:06
   --------------- ------------------------ 4.2/11.0 MB 1.3 MB/s eta 0:00:06
   ----------------- ---------------------- 4.7/11.0 MB 1.3 MB/s eta 0:00:05
   ------------------ --------------------- 5.0/11.0 MB 1.3 MB/s eta 0:00:05
   ------------------- -------------------- 5.2/11.0 MB 1.3 MB/s eta 0:00:05
   -------------------- ------------------- 5.5/11.0 MB 1.3 MB/s eta 0:00:05
   -------------------- ------------------- 5.8/11.0 MB 1.3 MB/s eta 0:00:04
   --------------------- ------------------ 6.0/11.0 MB 1.3 MB/s eta 0:00:04
   ---------------------- ----------------- 6.3/11.0 MB 1.3 MB/s eta 0:00:04
   ---------------------- ----------------- 6.3/11.0 MB 1.3 MB/s eta 0:00:04
   ----------------------- ---------------- 6.6/11.0 MB 1.3 MB/s eta 0:00:04
   ------------------------- -------------- 7.1/11.0 MB 1.3 MB/s eta 0:00:04
   -------------------------- ------------- 7.3/11.0 MB 1.3 MB/s eta 0:00:03
   -------------------------- ------------- 7.3/11.0 MB 1.3 MB/s eta 0:00:03
   --------------------------- ------------ 7.6/11.0 MB 1.3 MB/s eta 0:00:03
   ---------------------------- ----------- 7.9/11.0 MB 1.3 MB/s eta 0:00:03
   ----------------------------- ---------- 8.1/11.0 MB 1.3 MB/s eta 0:00:03
   ------------------------------ --------- 8.4/11.0 MB 1.2 MB/s eta 0:00:03
   ------------------------------ --------- 8.4/11.0 MB 1.2 MB/s eta 0:00:03
   ------------------------------- -------- 8.7/11.0 MB 1.2 MB/s eta 0:00:02
   ------------------------------- -------- 8.7/11.0 MB 1.2 MB/s eta 0:00:02
   -------------------------------- ------- 8.9/11.0 MB 1.2 MB/s eta 0:00:02
   -------------------------------- ------- 8.9/11.0 MB 1.2 MB/s eta 0:00:02
   --------------------------------- ------ 9.2/11.0 MB 1.2 MB/s eta 0:00:02
   ---------------------------------- ----- 9.4/11.0 MB 1.2 MB/s eta 0:00:02
   ----------------------------------- ---- 9.7/11.0 MB 1.2 MB/s eta 0:00:02
   ------------------------------------ --- 10.0/11.0 MB 1.2 MB/s eta 0:00:01
   -------------------------------------- - 10.5/11.0 MB 1.2 MB/s eta 0:00:01
   ---------------------------------------  10.7/11.0 MB 1.2 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 1.2 MB/s  0:00:09
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Installing collected packages: pytz, pandas

   ---------------------------------------- 0/2 [pytz]
   ---------------------------------------- 0/2 [pytz]
   ---------------------------------------- 0/2 [pytz]
   ---------------------------------------- 0/2 [pytz]
   ---------------------------------------- 0/2 [pytz]
   ---------------------------------------- 0/2 [pytz]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   ---------------------------------------- 2/2 [pandas]

Successfully installed pandas-2.3.3 pytz-2025.2
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

# **Pandas Series & DataFrames**
---

## **Data Structures in Pandas Library**

**1. Pandas Series**

* Like a single column of data in a spreadsheet
* 1D labelled array capable of holding data of any type
* Created by loading the datasets from existing storage like SQL Database, a CSV file or an Excel file
* Can be created from lists, dictionaries, scalar values, etc.

In [4]:
import pandas as pd
import numpy as np

ser = pd.Series()
print("Pandas Series: ", ser)

ser = pd.Series(dtype=float)
print("Pandas Series: ", ser)

# Creating pandas series using numpy array
data = np.array(['p', 'a', 'n', 'd', 'a', 's'])
ser = pd.Series(data)
print("Pandas Series:")
print(ser)

Pandas Series:  Series([], dtype: object)
Pandas Series:  Series([], dtype: float64)
Pandas Series:
0    p
1    a
2    n
3    d
4    a
5    s
dtype: object

In [7]:
data = np.array(['p', 'a', 'n', 'd', 'a', 's'])
ser = pd.Series(data, index = [10,11,12,13,14,15], name="example")
print(ser)

10    p
11    a
12    n
13    d
14    a
15    s
Name: example, dtype: object

In [66]:
df = pd.read_csv("nba.csv")
print(df)

              Name            Team  Number Position   Age Height  Weight            College     Salary
0    Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0              Texas  7730337.0
1      Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0          Marquette  6796117.0
2     John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0  Boston University        NaN
3      R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0      Georgia State  1148640.0
4    Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0                NaN  5000000.0
..             ...             ...     ...      ...   ...    ...     ...                ...        ...
453   Shelvin Mack       Utah Jazz     8.0       PG  26.0    6-3   203.0             Butler  2433333.0
454      Raul Neto       Utah Jazz    25.0       PG  24.0    6-1   179.0                NaN   900000.0
455   Tibor Pleiss       Utah Jazz    21.0        C  26.0    7-3   256.0                NaN  2900000.0
456    Jeff Withey       Utah Jazz    24.0        C  26.0    7-0   231.0             Kansas   947276.0
457            NaN             NaN     NaN      NaN   NaN    NaN     NaN                NaN        NaN

[458 rows x 9 columns]

In [8]:
ser = df['Name']
ser

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457              NaN
Name: Name, Length: 458, dtype: object

In [9]:
# We access the element of series using .loc[] function.

ser.loc[3:6]

3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
Name: Name, dtype: object

**Exercise**: Display the entries 10-15 from the Team column

In [10]:
df['Team'].loc[10:15]

10    Boston Celtics
11    Boston Celtics
12    Boston Celtics
13    Boston Celtics
14    Boston Celtics
15     Brooklyn Nets
Name: Team, dtype: object

In [11]:
df['Team'].iloc[10]

'Boston Celtics'

**Operations on Pandas Series**
* Addition, subtraction, division, multiplication

In [18]:
ser1 = pd.Series([1, 2, 3], index=['A', 'B', 'C'])
ser2 = pd.Series([4, 6, 0], index=['A', 'B', 'C'])
print(ser1)
print(ser2)
df_sum = ser1.add(ser2)
print(df_sum)

A    1
B    2
C    3
dtype: int64
A    4
B    6
C    0
dtype: int64
A    5
B    8
C    3
dtype: int64

In [15]:
df_sum = ser1.sub(ser2)
print(df_sum)

A   -3
B   -4
C   -2
dtype: int64

In [16]:
df_sum = ser1.mul(ser2)
print(df_sum)

A     4
B    12
C    15
dtype: int64

In [19]:
df_sum = ser1.div(ser2)
print(df_sum)

A    0.250000
B    0.333333
C         inf
dtype: float64

**Exercise**: Find the ratio of Weight to Age from the nba dataset

In [20]:
df['Weight'].div(df['Age'])

0      7.200000
1      9.400000
2      7.592593
3      8.409091
4      7.965517
         ...
453    7.807692
454    7.458333
455    9.846154
456    8.884615
457         NaN
Length: 458, dtype: float64

**Creating a series from a Dictionary**

In [22]:
data_dict = {'numPy': 10, 'and': 20, 'pandas': 30}

ser = pd.Series(data_dict, name="pandas_from_dict")
print(ser)

numPy     10
and       20
pandas    30
Name: pandas_from_dict, dtype: int64

**Creating a Series Using NumPy Functions**

In [23]:
ser = pd.Series(np.linspace(1, 10, 5))
print(ser)

0     1.00
1     3.25
2     5.50
3     7.75
4    10.00
dtype: float64

**Exercise**: Create a Pandas series with the following values:

1: 1  
2: 4  
3: 9  
4: 16  
5: 25  

**Hint**: Use arange or linspace

In [54]:
print(pd.Series(np.arange(1, 6, 1)*np.arange(1, 6, 1)))

s = (pd.Series(np.square(np.arange(1, 6, 1)), index=[1,2,3,4,5]))
s
s.iloc[2]

0     1
1     4
2     9
3    16
4    25
dtype: int64

np.int64(9)

**Creating a Series Using range()**

In [26]:
ser = pd.Series(range(5, 15))
print(ser)

0     5
1     6
2     7
3     8
4     9
5    10
6    11
7    12
8    13
9    14
dtype: int64

**2. Pandas Dataframe**
* 2D data structure with labelled axes (rows and columns)
* Created by loading the datasets from existing storage like SQL Database, a CSV file or an Excel file
* Can be created from lists, dictionaries, scalar values, etc.

In [27]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

**Creating a DataFrame from a List**
* Each item in the list becomes a row
* The DataFrame consists of a single unnamed column

In [28]:
lst = ['numPy', 'dataframe', 'Pandas', 'series', 'python', 'excel', 'csv']

df = pd.DataFrame(lst)
print(df)

           0
0      numPy
1  dataframe
2     Pandas
3     series
4     python
5      excel
6        csv

**Creating DataFrame from Numpy Array**

In [29]:
data = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
df = pd.DataFrame(data)
print(df)

# shape function will give info of how many columns and rows present in the dataframe
print(f"\nShape of df = {df.shape}")

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

Shape of df = (3, 3)

In [31]:
pd.DataFrame(data, columns=['A', 'B', 'C'], index=[1,2,3])

   A  B  C
1  1  2  3
2  4  5  6
3  7  8  9

**Creating a DataFrame from a Dictionary**

In [35]:
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}

# Keys become column names
df = pd.DataFrame(dict)

print(df)

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

**Creating a DataFrame from a List of Dictionaries**

In [36]:
data = [{'a': 1, 'b': 2, 'c': 3},
        {'a': 10, 'b': 20, 'c': 30}]

# Creates DataFrame.
df = pd.DataFrame(data)

print(df)

    a   b   c
0   1   2   3
1  10  20  30

**Creating a DataFrame from a Dictionary of Series**

In [39]:
# Initialize data to Dicts of series.
d = {'one': pd.Series([10, 20, 30, 40],
                      index=['a', 'b', 'c', 'd']),
     'two': pd.Series([10, 20, 30, 40],
                      index=['a', 'b', 'c', 'd'])}

# creates Dataframe.
df = pd.DataFrame(d)

print(df)

   one  two
a   10   10
b   20   20
c   30   30
d   40   40

**Pandas Dataframe/Series.head() method**
* Used to return top n (5 by default) rows of a data frame or series.

In [40]:
# making data frame
data = pd.read_csv("nba.csv")

# calling head() method
# storing in new variable
data.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [41]:
data.head(9)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0

In [42]:
series = data['Name']
series.head(8)

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
7     Kelly Olynyk
Name: Name, dtype: object

**Pandas Dataframe/Series.tail() method**
* Helps us see the last n rows of a DataFrame or Series.

In [43]:
data.tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [44]:
data.tail(12)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
446,Derrick Favors,Utah Jazz,15.0,PF,24.0,6-10,265.0,Georgia Tech,12000000.0
447,Rudy Gobert,Utah Jazz,27.0,C,23.0,7-1,245.0,NaN,1175880.0
448,Gordon Hayward,Utah Jazz,20.0,SF,26.0,6-8,226.0,Butler,15409570.0
449,Rodney Hood,Utah Jazz,5.0,SG,23.0,6-8,206.0,Duke,1348440.0
450,Joe Ingles,Utah Jazz,2.0,SF,28.0,6-8,226.0,NaN,2050000.0
451,Chris Johnson,Utah Jazz,23.0,SF,26.0,6-6,206.0,Dayton,981348.0
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

**Dealing with Columns and Rows**

**1. Multi-Column Selection**

In [45]:
df = pd.DataFrame(data)
df[['Height', 'Weight']]

    Height  Weight
0      6-2   180.0
1      6-6   235.0
2      6-5   205.0
3      6-5   185.0
4     6-10   231.0
..     ...     ...
453    6-3   203.0
454    6-1   179.0
455    7-3   256.0
456    7-0   231.0
457    NaN     NaN

[458 rows x 2 columns]

**Exercise**: Print the top 7 rows of Height and Weight column

In [46]:
data[['Height', 'Weight']].head(7)

  Height  Weight
0    6-2   180.0
1    6-6   235.0
2    6-5   205.0
3    6-5   185.0
4   6-10   231.0
5    6-9   240.0
6    6-8   235.0

**2. Column Addition**

In [68]:
# Define a dictionary containing employee data
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

# Convert the dictionary into DataFrame
df = pd.DataFrame(data1)
print(df)
print('----------------------')
# Declare a list that is to be converted into a column
address = ['Delhi', 'Bangalore', 'Chennai', 'Patna']

# Using 'Address' as the column name and equating it to the list
df['Address'] = address
print(df)

     Name  Age Qualification
0     Jai   27           Msc
1  Princi   24            MA
2  Gaurav   22           MCA
3    Anuj   32           Phd
----------------------
     Name  Age Qualification    Address
0     Jai   27           Msc      Delhi
1  Princi   24            MA  Bangalore
2  Gaurav   22           MCA    Chennai
3    Anuj   32           Phd      Patna

In [71]:
df = df.assign(Holiday = ['NewYork', 'Chicago', 'Boston', 'Miami'])
df

     Name  Age Qualification    Address  Holiday
0     Jai   27           Msc      Delhi  NewYork
1  Princi   24            MA  Bangalore  Chicago
2  Gaurav   22           MCA    Chennai   Boston
3    Anuj   32           Phd      Patna    Miami

In [49]:
df.insert(2, "Marks", [86, 91, 56, 70])
df

     Name  Age  Marks Qualification    Address  Holiday
0     Jai   27     86           Msc      Delhi  NewYork
1  Princi   24     91            MA  Bangalore  Chicago
2  Gaurav   22     56           MCA    Chennai   Boston
3    Anuj   32     70           Phd      Patna    Miami

**3. Column Deletion**

In [57]:
# making data frame from csv file
pd.set_option('display.max_columns', None)
pd.set_option('display.width', 10000)
pd.set_option('display.max_colwidth', None)

data = pd.read_csv("nba.csv")
print(data.head(2))
# dropping passed columns
data.drop(["Team", "Weight"], axis = 1, inplace = True)
print("\n-----New Data-----\n")
# display
print(data.head(2))

print("\n\n\n\n", data.loc[2:5])

            Name            Team  Number Position   Age Height  Weight    College     Salary
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0      Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0  Marquette  6796117.0

-----New Data-----

            Name  Number Position   Age Height    College     Salary
0  Avery Bradley     0.0       PG  25.0    6-2      Texas  7730337.0
1    Jae Crowder    99.0       SF  25.0    6-6  Marquette  6796117.0




             Name  Number Position   Age Height            College      Salary
2   John Holland    30.0       SG  27.0    6-5  Boston University         NaN
3    R.J. Hunter    28.0       SG  22.0    6-5      Georgia State   1148640.0
4  Jonas Jerebko     8.0       PF  29.0   6-10                NaN   5000000.0
5   Amir Johnson    90.0       PF  29.0    6-9                NaN  12000000.0

**4. Row Selection**

In [73]:
data = pd.read_csv("nba.csv", index_col ="Name")
print(data.head(4))
print('\n\n\n')
# retrieving row by loc method
first = data.loc["Jae Crowder"]
second = data.iloc[0]

print(first, "\n\n\n", second)

                         Team  Number Position   Age Height  Weight            College     Salary
Name
Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0              Texas  7730337.0
Jae Crowder    Boston Celtics    99.0       SF  25.0    6-6   235.0          Marquette  6796117.0
John Holland   Boston Celtics    30.0       SG  27.0    6-5   205.0  Boston University        NaN
R.J. Hunter    Boston Celtics    28.0       SG  22.0    6-5   185.0      Georgia State  1148640.0




Team        Boston Celtics
Number                99.0
Position                SF
Age                   25.0
Height                 6-6
Weight               235.0
College          Marquette
Salary           6796117.0
Name: Jae Crowder, dtype: object


 Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
Name: Avery Bradley, dtype: object

In [62]:
data.loc[['Avery Bradley', 'R.J. Hunter']]

                         Team  Number Position   Age Height  Weight        College     Salary
Name
Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0          Texas  7730337.0
R.J. Hunter    Boston Celtics    28.0       SG  22.0    6-5   185.0  Georgia State  1148640.0

In [74]:
data.loc[['Avery Bradley', 'R.J. Hunter'], ['Height', 'Weight']]

              Height  Weight
Name
Avery Bradley    6-2   180.0
R.J. Hunter      6-5   185.0

**2. Row Addition**

In [75]:
import pandas as pd
df = pd.read_csv("nba.csv")
print(df.head(2))
print("\n\n\n")
new_row = pd.DataFrame({'Name':'Sam', 'Team':'Boston', 'Number':3,
                           'Position':'PG', 'Age':33, 'Height':'6-2',
                        'Weight':189, 'College':'MIT', 'Salary':99999}, index=[0])
# simply concatenate both dataframes
df = pd.concat([new_row, df])
print(df.head(2))

            Name            Team  Number Position   Age Height  Weight    College     Salary
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0      Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0  Marquette  6796117.0




            Name            Team  Number Position   Age Height  Weight College     Salary
0            Sam          Boston     3.0       PG  33.0    6-2   189.0     MIT    99999.0
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0   Texas  7730337.0

In [80]:
df = pd.read_csv("nba.csv")
print(df.head(2))
print("\n\n")
con = pd.concat([new_row, df])
print("\n\n")
print(con)

df = con.reset_index(drop=False)
print("\n\n\n", df.head(2))

            Name            Team  Number Position   Age Height  Weight    College     Salary
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0      Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0  Marquette  6796117.0






              Name            Team  Number Position   Age Height  Weight            College     Salary
0              Sam          Boston     3.0       PG  33.0    6-2   189.0                MIT    99999.0
0    Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0              Texas  7730337.0
1      Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0          Marquette  6796117.0
2     John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0  Boston University        NaN
3      R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0      Georgia State  1148640.0
..             ...             ...     ...      ...   ...    ...     ...                ...        ...
453   Shelvin Mack       Utah Jazz     8.0       PG  26.0    6-3   203.0             Butler  2433333.0
454      Raul Neto       Utah Jazz    25.0       PG  24.0    6-1   179.0                NaN   900000.0
455   Tibor Pleiss       Utah Jazz    21.0        C  26.0    7-3   256.0                NaN  2900000.0
456    Jeff Withey       Utah Jazz    24.0        C  26.0    7-0   231.0             Kansas   947276.0
457            NaN             NaN     NaN      NaN   NaN    NaN     NaN                NaN        NaN

[459 rows x 9 columns]



    index           Name            Team  Number Position   Age Height  Weight College     Salary
0      0            Sam          Boston     3.0       PG  33.0    6-2   189.0     MIT    99999.0
1      0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0   Texas  7730337.0

In [81]:
pd.concat([df, new_row]).reset_index(drop = True).tail(2)

     index Name    Team  Number Position   Age Height  Weight College   Salary
458  457.0  NaN     NaN     NaN      NaN   NaN    NaN     NaN     NaN      NaN
459    NaN  Sam  Boston     3.0       PG  33.0    6-2   189.0     MIT  99999.0

**3. Row Deletion**

In [82]:
data = pd.read_csv("nba.csv")
print(data.head(6))
print("\n\n\n")

data.drop([1, 3, 4], inplace=True)
# display
print(data.head(6))

            Name            Team  Number Position   Age Height  Weight            College      Salary
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0              Texas   7730337.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0          Marquette   6796117.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0  Boston University         NaN
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0      Georgia State   1148640.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0                NaN   5000000.0
5   Amir Johnson  Boston Celtics    90.0       PF  29.0    6-9   240.0                NaN  12000000.0




            Name            Team  Number Position   Age Height  Weight            College      Salary
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0              Texas   7730337.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0  Boston University         NaN
5   Amir Johnson  Boston Celtics    90.0       PF  29.0    6-9   240.0                NaN  12000000.0
6  Jordan Mickey  Boston Celtics    55.0       PF  21.0    6-8   235.0                LSU   1170960.0
7   Kelly Olynyk  Boston Celtics    41.0        C  25.0    7-0   238.0            Gonzaga   2165160.0
8   Terry Rozier  Boston Celtics    12.0       PG  22.0    6-2   190.0         Louisville   1824360.0

In [ ]:
data.reset_index(drop=True)

# **Missing Values, Handling Missing Values**


---

**Checking Missing Values in Pandas** \\
**1. Using isnull()**

In [92]:
d = {'First Score': [100, 90, np.nan, 89],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score': [np.nan, 40, 80, 98]}
df = pd.DataFrame(d)
print(df)
print('\n\n')
mv = df.isnull()
print(mv)

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         89.0           NaN         98.0



   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

**2. Using notnull()**

In [85]:
nmv = df.notnull()

print(nmv)

   First Score  Second Score  Third Score
0         True          True        False
1         True          True         True
2         True          True         True
3         True         False         True

**Filling Missing Values in Pandas** \\
**1. Using fillna()**

In [86]:
print(df)
print('\n')
print(df.fillna(0))

   First Score  Second Score  Third Score
0          100          30.0          NaN
1           90          45.0         40.0
2           89          56.0         80.0
3           95           NaN         98.0


   First Score  Second Score  Third Score
0          100          30.0          0.0
1           90          45.0         40.0
2           89          56.0         80.0
3           95           0.0         98.0

**2. Using ffill()**

In [87]:
print(df)
# ffill will propogate the last observed value along the axis
df.ffill()

   First Score  Second Score  Third Score
0          100          30.0          NaN
1           90          45.0         40.0
2           89          56.0         80.0
3           95           NaN         98.0

   First Score  Second Score  Third Score
0          100          30.0          NaN
1           90          45.0         40.0
2           89          56.0         80.0
3           95          56.0         98.0

In [90]:
df.ffill(axis=1)

   First Score  Second Score  Third Score
0        100.0          30.0         30.0
1         90.0          45.0         40.0
2         89.0          56.0         80.0
3          NaN           NaN         98.0

**3. Using bfill()**

In [93]:
print(df)
df.bfill()

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         89.0           NaN         98.0

   First Score  Second Score  Third Score
0        100.0          30.0         40.0
1         90.0          45.0         40.0
2         89.0          56.0         80.0
3         89.0           NaN         98.0

In [97]:
print(df)
df.bfill(axis=1)

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         89.0           NaN         98.0

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         56.0          56.0         80.0
3         89.0          98.0         98.0

**4. Using replace()**

In [ ]:
df.replace(to_replace=np.nan, value=-99)

In [ ]:
df.replace(to_replace=30, value=-99)

**Dropping Missing Values in Pandas**

**1. Dropping Rows with At Least One Null Value**

In [99]:
print(df)
print("\n\n\n")

# Dropping row which has atleat one NaN in a row
df.dropna()

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         89.0           NaN         98.0

   First Score  Second Score  Third Score
1         90.0          45.0         40.0

**2. Dropping Rows with All Null Values**

In [100]:
print(df,"\n\n\n")

# Drop rows which has all value as NaN
print(df.dropna(how='all'))

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         89.0           NaN         98.0



   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         89.0           NaN         98.0

**3. Dropping Columns with At Least One Null Value**

In [101]:
dict = {'First Score': [100, np.nan, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score': [52, np.nan, 80, 98],
        'Fourth Score': [60, 67, 68, 65],
        'Fifth Score': [np.nan, np.nan, np.nan, np.nan]}
df = pd.DataFrame(dict)
print(df)
print("\n\n\n")

# Dropping all column which has atleast 1 NaN value
print(df.dropna(axis=1))

   First Score  Second Score  Third Score  Fourth Score  Fifth Score
0        100.0          30.0         52.0            60          NaN
1          NaN           NaN          NaN            67          NaN
2          NaN          45.0         80.0            68          NaN
3         95.0          56.0         98.0            65          NaN




   Fourth Score
0            60
1            67
2            68
3            65

**Exercise**: Drop columns with all null values

In [ ]:
print(df,"\n\n\n")

# Drop columns which has all value as Nan
df.dropna(how='all', axis=1)

# **Data Operations**

---


**Pandas GroupBy**
* Motivation : Books of different genres in a Library, departments in an office etc.
* Group data by one or more categories and then apply different functions to those groups

**Splitting Data into Groups**
* Refers to dividing the dataset into groups based on a particular condition or key

In [102]:
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',
                 'Gaurav', 'Anuj', 'Princi', 'Abhi', 'Jai'],
        'Age':[27, 24, 22, 32,
               33, 36, 27, 32, 29],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh', 'Chennai'],
        'Qualification':['MSc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA', 'MSc']}
df = pd.DataFrame(data1)
print(df, "\n\n\n")
print(df.groupby('Name').groups)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           MSc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA
8     Jai   29    Chennai           MSc



{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2, 8], 'Princi': [3, 6]}

In [103]:
# Group keys are sorted by default
gk = df.groupby('Name')

gk.size()

Name
Abhi      1
Anuj      2
Gaurav    1
Jai       3
Princi    2
dtype: int64

In [104]:
# This function will get 1st index of all the groups and return a datafram
gk.first()

        Age  Address Qualification
Name
Abhi     32  Aligarh            MA
Anuj     24   Kanpur            MA
Gaurav   33  Jaunpur        B.Tech
Jai      27   Nagpur           MSc
Princi   32  Kannuaj           Phd

In [105]:
gk['Age'].sum()

Name
Abhi      32
Anuj      60
Gaurav    33
Jai       78
Princi    59
Name: Age, dtype: int64

In [106]:

# groupby function by default disable sorting, to improve performance we can
# disable sorting
gk = df.groupby(['Name'], sort=False)
gk['Age'].sum()

Name
Jai       78
Anuj      60
Princi    59
Gaurav    33
Abhi      32
Name: Age, dtype: int64

**Exercise**: Group the above data by address and print the size and first entry in each group.

In [ ]:
gk = df.groupby('Address')
print(gk.groups)
print('-----------------------------------')
print(gk.size())
print('-----------------------------------')
print(gk.first())

In [ ]:
print(df.groupby(['Name', 'Qualification']).groups)

**How can we Iterate through groups ?**

**Selecting a group**

In [107]:
grp = df.groupby('Name')
grp.get_group('Jai')

  Name  Age    Address Qualification
0  Jai   27     Nagpur           MSc
2  Jai   22  Allahabad           MCA
8  Jai   29    Chennai           MSc

**Applying Functions to Groups**
* After splitting a data into a group we apply a function to each group

**1. Aggregation**
* It allows us to find a summary statistic for each group like summing or averaging values

In [108]:
grp1 = df.groupby('Name')
print(grp1.groups)
print(grp1['Age'].aggregate(["sum", "mean", "std"]))

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2, 8], 'Princi': [3, 6]}
        sum  mean       std
Name
Abhi     32  32.0       NaN
Anuj     60  30.0  8.485281
Gaurav   33  33.0       NaN
Jai      78  26.0  3.605551
Princi   59  29.5  3.535534

In [ ]:
grp1 = df.groupby(['Name', 'Qualification'])
grp1['Age'].aggregate("sum")

**2. Transformation**
* In this we perform some group-specific computations and return a result with the same index as the original data.

In [109]:
square = lambda x: x * x
print(square(5))   # Output: 25

25

In [113]:
df = df.assign(Score=[23, 34, 35, 45, 47, 50, 52, 53, 44])
print(df)
print('------------------------------------------------')
grp2 = df.groupby('Name')
sc = lambda x: (x*x)
print(grp2['Age'].aggregate(["mean", "std"]))
print('------------------------------------------------')
print(grp2['Age'].transform(sc))

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           MSc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
4  Gaurav   33    Jaunpur        B.Tech     47
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52
7    Abhi   32    Aligarh            MA     53
8     Jai   29    Chennai           MSc     44
------------------------------------------------
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000021AFF4E0D10>
        mean       std
Name
Abhi    32.0       NaN
Anuj    30.0  8.485281
Gaurav  33.0       NaN
Jai     26.0  3.605551
Princi  29.5  3.535534
------------------------------------------------
0     729
1     576
2     484
3    1024
4    1089
5    1296
6     729
7    1024
8     841
Name: Age, dtype: int64

**3. Filtration**
* Used to discard groups based on a condition

In [111]:
print(grp2.groups)
grp2.filter(lambda x: len(x) >= 2)

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2, 8], 'Princi': [3, 6]}

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           MSc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52
8     Jai   29    Chennai           MSc     44

**Grouping Rows in pandas**

In [114]:
example = {'Team':['Arsenal', 'Manchester United', 'Arsenal',
                   'Arsenal', 'Chelsea', 'Manchester United',
                   'Manchester United', 'Chelsea', 'Chelsea', 'Chelsea'],

           'Player':['Ozil', 'Pogba', 'Lucas', 'Aubameyang',
                       'Hazard', 'Mata', 'Lukaku', 'Morata',
                                         'Giroud', 'Kante'],

           'Goals':[5, 3, 6, 4, 9, 2, 0, 5, 2, 3] }

df = pd.DataFrame(example)

print(df)

                Team      Player  Goals
0            Arsenal        Ozil      5
1  Manchester United       Pogba      3
2            Arsenal       Lucas      6
3            Arsenal  Aubameyang      4
4            Chelsea      Hazard      9
5  Manchester United        Mata      2
6  Manchester United      Lukaku      0
7            Chelsea      Morata      5
8            Chelsea      Giroud      2
9            Chelsea       Kante      3

In [115]:
# Objective: Find out aggregate of goals per team

total_goals = df['Goals'].groupby(df['Team'])

# printing the means value
print(total_goals.mean())
print('------------------------------------------------')
print(total_goals.sum())

Team
Arsenal              5.000000
Chelsea              4.750000
Manchester United    1.666667
Name: Goals, dtype: float64
------------------------------------------------
Team
Arsenal              15
Chelsea              19
Manchester United     5
Name: Goals, dtype: int64

In [ ]:
example = {'Team':['Australia', 'England', 'South Africa',
                   'Australia', 'England', 'India', 'India',
                        'South Africa', 'England', 'India'],

           'Player':['Ricky Ponting', 'Joe Root', 'Hashim Amla',
                     'David Warner', 'Jos Buttler', 'Virat Kohli',
                     'Rohit Sharma', 'David Miller', 'Eoin Morgan',
                                                 'Dinesh Karthik'],

          'Runs':[345, 336, 689, 490, 989, 672, 560, 455, 342, 376],

          'Salary':[34500, 33600, 68900, 49000, 98899,
                    67562, 56760, 45675, 34542, 31176] }

df = pd.DataFrame(example)

**Exercise**: Find the mean salary per team.

In [ ]:
total_salary = df['Salary'].groupby(df['Team'])

# printing the means value
print(total_salary.mean())

In [ ]:
data = {
    'Store': ['A', 'A', 'B', 'B', 'A', 'B'],
    'Product': ['Apple', 'Banana', 'Apple', 'Banana', 'Apple', 'Banana'],
    'Sales': [100, 150, 200, 100, 120, 180],
    'Quantity': [10, 20, 30, 40, 15, 35]
}

df = pd.DataFrame(data)
display(df)
# Obj: Find the total sales and average quantity sold per store
# Grouping by 'Store' and applying different aggregation functions
agg_dict = {
    'Sales': 'sum',          # Sum the 'Sales' column
    'Quantity': 'mean'       # Find the mean of the 'Quantity' column
}

result = df.groupby('Store').agg(agg_dict)

display(result)

**Exercise**: Find the total and mean sales and maximum and minimum quantity sold per store

In [ ]:
agg_dict = {
    'Sales': ['sum', 'mean'],       # Sum and mean for 'Sales'
    'Quantity': ['max', 'min']      # Max and min for 'Quantity'
}

result = df.groupby('Store').agg(agg_dict)

display(result)